backend/app/Models/EmpresasModel.php

    public function getEmpresas($id = false)
    {
        if (!$id) {
            return $this->findAll();
        }

        return $this->asArray()
            ->where(['id' => $id])
            ->first();
---
SELECT *
FROM `empresas`
WHERE `id` = '1'
AND `empresas`.`deleted_at` IS NULL
 LIMIT 1