backend/app/Models/UsuariosModel.php

SELECT *
FROM `usuarios`
WHERE `id` = 'undefined'
 LIMIT 1
---
    public function getUsuarios($usuario)
    {
        return $this->asArray()
            ->where(['id' => $usuario])
            ->first();

SELECT *
FROM `usuarios`
WHERE `usuario` = 'debora.mello'
 LIMIT 1
---
    public function getUsuario($usuario)
    {
        return $this->asArray()
            ->where(['usuario' => $usuario])
            ->first();