app/Models/FuncionariosModel.php

    public function getFuncionario($funcionario = null)
    {
        if ($funcionario):
            return $this->asArray()
                ->where(['funcionario' => $funcionario])
                ->first();
        endif;

        return $this->asArray()->findAll();
---
SELECT *
FROM `funcionarios`