backend/app/Controllers/Usuarios/Usuarios.php

SELECT `id`, `usuario`
FROM `usuarios`
---
    public function listar(): ResponseInterface
    {

        $model = new UsuariosModel();

        return $this->respond([
            'usuarios' => $model->select('id, usuario')->findAll(),
        ]);

DELETE FROM `usuarios`
WHERE `id` IN (49)
---
    public function excluir(): ResponseInterface
    {
        $id = json_decode($this->request->getBody(), true);

        $model = new UsuariosModel();
        $model->delete($id);

SELECT `id`, `usuario`
FROM `usuarios`
WHERE `usuario` LIKE '%debora.%' ESCAPE '!'
---
    public function buscar():ResponseInterface
    {
        $model = new UsuariosModel();
        $busca = json_decode($this->request->getBody(), true);

        return $this->respond([
            'usuarios' => $model->select('id, usuario')->like('usuario', $busca)->findAll(),
        ]);